# ===========================================
# Brewfile — Declarative package management
# Usage: brew bundle --file=Brewfile
# ===========================================

# --- Shell ---
brew "bash"           # bash 5.x (macOS ships with ancient 3.2)
brew "starship"       # prompt

# --- Modern CLI Replacements ---
brew "eza"            # ls replacement
brew "bat"            # cat replacement
brew "ripgrep"        # grep replacement
brew "fd"             # find replacement
brew "zoxide"         # cd replacement
brew "fzf"            # fuzzy finder

# --- Git ---
brew "git"
brew "git-delta"      # git diff pager with syntax highlighting
brew "lazygit"        # git TUI
brew "gh"             # GitHub CLI
brew "gum"            # interactive prompts (used in worktree helpers)

# --- Editor ---
brew "neovim"

# --- Terminal Multiplexer ---
brew "tmux"

# --- Version Manager ---
brew "mise"           # runtime version manager (replaces nvm/rbenv/etc)

# --- Utilities ---
brew "direnv"         # per-project env vars

# --- macOS only (casks) ---
cask "alacritty"
cask "font-jetbrains-mono-nerd-font"
