# ===========================================
# Brewfile — Declarative package management
# Usage: brew bundle --file=Brewfile
# ===========================================

# --- Shell & Prompt ---
brew "zsh"
brew "sheldon"        # zsh plugin manager
brew "starship"       # prompt

# --- Modern CLI Replacements ---
brew "eza"            # ls replacement
brew "bat"            # cat replacement
brew "ripgrep"        # grep replacement
brew "fd"             # find replacement
brew "zoxide"         # cd replacement
brew "fzf"            # fuzzy finder

# --- Git ---
brew "git"
brew "git-delta"      # git diff pager with syntax highlighting
brew "lazygit"        # git TUI
brew "gh"             # GitHub CLI
brew "gum"            # interactive prompts (used in worktree helpers)

# --- Editor ---
brew "neovim"

# --- Terminal Multiplexer ---
brew "tmux"

# --- Version Manager ---
brew "mise"           # runtime version manager (replaces nvm/rbenv/etc)

# --- Utilities ---
brew "direnv"         # per-project env vars
brew "stow"           # symlink farm manager

# --- macOS only (casks) ---
cask "wezterm"
cask "font-hack-nerd-font"
